Catalogs/упГеографическиеЗоны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упГеографическиеЗоны</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Nominatim_place_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>osm_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗоны</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыЗон</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляУчетаМестоположений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксДолгота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксШирота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинДолгота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинШирота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подтверждена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроходитЧерез180Меридиан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчитыватьПопарныеРасстоянияМеждуТочкамиЗоны</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчитыватьРасстоянияСУчетомДополнительныхОграниченийСитиГИД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упРегионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтильОтображения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтилиПолигонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Полигон</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Широта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Долгота</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолигонПростой</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Широта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Долгота</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/упЗональныеНастройкиМаршрутизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упЗональныеНастройкиМаршрутизации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Граница</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Расстояние</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентДоГраницы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентПослеГраницы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗонаОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗонаПолучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/упТипыМаршрутизаторов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упТипыМаршрутизаторов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>AxelotMaps</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Graphhopper</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GoogleMaps</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СитиГИД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексМаршрутизация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упАдреса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упАдреса</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидАдреса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыАдресов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРаботВТочке</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяУбытияИзТочки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГеографическаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопустимоеОтклонениеУбытияИзТочки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВремяУбытияИзТочки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаселенныйПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормализованноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подтвержден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упРегионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегионСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСклады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПомещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтроения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упЧасовыеПояса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеКоординаты</Name>
					<Comment>Представление широты и долготы в формате "34.451234;45.345666;"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/упГеографическиеЗоны/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	Если упСервисныеФункции.ЭтоВызовПослеОткрытияФормы(ЭтаФорма) Тогда
		ПриСозданииПриЧтенииНаСервере();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииПриЧтенииНаСервере()
	ЕстьПравоРедактировать = Справочники.упАдреса.ВыполнитьПроверкуПраваПодтверждениеКорректностиГеографическихДанных();
	
	Если ЗначениеЗаполнено(Объект.Ссылка) И Объект.Подтверждена Тогда
		// Для утвержденных объектов нельзя вносить изменения.		
		ТолькоПросмотр = НЕ ЕстьПравоРедактировать;
		// Отключим доступность к командам.
		//Элементы.КоэффициентыРасчетаВремениВПутиПоДнямОбновитьКоэффициентыРасчетаВремениВПути.Доступность = Ложь;
	КонецЕсли;
	
	Элементы.Подтверждена.ТолькоПросмотр = НЕ ЕстьПравоРедактировать;
	
	Элементы.упРассчитыватьРасстоянияСУчетомДополнительныхОграниченийСитиГИД.Видимость = Истина
		И ЭтаФорма.РассчитыватьРасстоянияСУчетомДополнительныхОграниченийСитиГИД
		И ЭтаФорма.ТипМаршрутизатора = ПредопределенноеЗначение("Перечисление.упТипыМаршрутизаторов.СитиГИД");
		
	Набор = РегистрыСведений.упЗональныеНастройкиМаршрутизации.СоздатьНаборЗаписей();
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Набор.Отбор.ЗонаОтправления.Установить(Объект.Ссылка);
		Набор.Прочитать();
	КонецЕсли; 
	ЭтаФорма.ЗональныеНастройкиМаршрутизации.Загрузить(Набор.Выгрузить());

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Свойства.
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства.
	
	ЭтаФорма.ТипМаршрутизатора  = упСервисныеФункции.ПолучитьЗначениеКонстанты("упТипМаршрутизатора");
	РассчитыватьРасстоянияСУчетомДополнительныхОграниченийСитиГИД = ПолучитьФункциональнуюОпцию("упРассчитыватьРасстоянияСУчетомДополнительныхОграниченийСитиГИД");
		
	ПриСозданииПриЧтенииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	 УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	Если Ложь Тогда // Для контекстной подсказки
	    ТекущийОбъект = Справочники.упГеографическиеЗоны.СоздатьЭлемент();
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("упУчитыватьКоэффициентыРасчетаВремениВПути") Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ЗональныеНастройкиМаршрутизации", ЗональныеНастройкиМаршрутизации.Выгрузить());
	КонецЕсли;
	ТекущийОбъект.ПолигонПростой.Очистить(); // Можно очищать только после сравнения старой и новой ТЧ Полигон

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства. 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства.
	
	Если ИмяСобытия = "ИмпортCSVФайлаВПолигон" И Источник = ЭтаФорма Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаИмпорта",ЭтаФорма,Параметр);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Заполнить табличную часть полигон географической зоны?';"+ " en = 'Do you want to continue?'"), Режим, 0);
	КонецЕсли;
	упСервисныеФункцииКлиент.ФормаСсылочныйОбъект_ОбработкаОповещения(ЭтаФорма, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура РодительПриИзменении(Элемент)
	 
	Если ЗначениеЗаполнено(Объект.Родитель) Тогда 
		ЗаполнитьСтрануИРегион();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолигонДолготаПриИзменении(Элемент)
	
	Если Объект.Полигон.Количество() Тогда 
		МинМеридиан  = Объект.Полигон[0].Долгота;
		МаксМеридиан = Объект.Полигон[0].Долгота;
		
		Для Каждого текВершина Из Объект.Полигон Цикл 
			МинМеридиан  = Мин(МинМеридиан, текВершина.Долгота);
			МаксМеридиан = Макс(МаксМеридиан, текВершина.Долгота);
		КонецЦикла;
		
		Если МаксМеридиан - МинМеридиан > 270 Тогда 
			Объект.ПроходитЧерез180Меридиан = Истина;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитыватьПопарныеРасстоянияМеждуТочкамиЗоныПриИзменении(Элемент)
	
	Элементы.упРассчитыватьРасстоянияСУчетомДополнительныхОграниченийСитиГИД.ТолькоПросмотр = НЕ Объект.РассчитыватьПопарныеРасстоянияМеждуТочкамиЗоны;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Выполнить действия после получения оповещения.
//
// Параметры:
//  РезультатВопроса  - КодВозвратаДиалога - Результат ответа на вопрос.
//  ДополнительныеПараметры  - Структура - Параметры ответа.
//
Процедура ПослеЗакрытияВопросаИмпорта(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса =  КодВозвратаДиалога.Да Тогда
		СтрокиФайла = ДополнительныеПараметры.Массив;
		Объект.Полигон.Очистить();
		Объект.ПолигонПростой.Очистить();
		Для Каждого текЭлемент Из СтрокиФайла Цикл
			НоваяСтрока = Объект.Полигон.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,текЭлемент)			
		КонецЦикла;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры // ПослеЗакрытияВопросаИмпорта()

&НаСервере
Процедура ЗаполнитьСтрануИРегион()
	
	сткДанныеРодителя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Родитель, "Регион, Страна");
	Если ЗначениеЗаполнено(сткДанныеРодителя.Страна) Тогда 
		Объект.Страна = сткДанныеРодителя.Страна;
	КонецЕсли;	
	Если ЗначениеЗаполнено(сткДанныеРодителя.Регион) Тогда 
		Объект.Регион = сткДанныеРодителя.Регион;
	ИначеЕсли ЗначениеЗаполнено(Объект.Регион) Тогда 
		Если Объект.Страна <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Регион, "Владелец") Тогда 
			Объект.Регион = сткДанныеРодителя.Регион;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств(Команда)
	
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	  
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства.
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства.
КонецПроцедуры

#КонецОбласти
